#Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.
#
#Формат входных данных
#На вход программе подаётся два числа с плавающей точкой – длины катетов, каждое на отдельной строке.
#
#Формат выходных данных
#Программа должна вывести одно число – площадь треугольника.

f1 = float(input())
f2 = float(input())
print(0.5 * f1 * f2)